Revit 2027 API
BuiltInFailures.AutoRouteFailures.FailToDoCompatiblePhaseError Property
 The solution is failing to do the elements Phases are compatible.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FailToDoCompatiblePhaseError { get; }
Public Shared ReadOnly Property FailToDoCompatiblePhaseError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FailToDoCompatiblePhaseError {
	FailureDefinitionId^ get ();
}
static member FailToDoCompatiblePhaseError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace